/**
  السلام عليكم
  فكره المشروع هو rest api لباسورد مانجر 
  ببساطه مكان يحفظ الباسوردات بتاعتك
  index.ts هو الملف الاساسي الي بيبدأ عنده المشروع 
  اول حاجه هوضح فكره عن المكتبات الي استخدمتها وفكره بسيطه عنها 
  ##########################################################################
  1- devDependencies
    -dotenv ببساطه بتخليك تقدر تخزن فاريبل في ملف خارجي 
    -nodemon بيساعدك وانت بتكتب الكود انه بيعمل ريستارت للسيرفر بعد كل حفظ للملف
  2- dependencies
    -bcryptjs بتستخدم لعمل تشفير اشهر استخدام تشفير الباسورد
    -body-parser بتحول الداتا الي جايه من الكلاينت لداتا تقدر تتعامل معاها
    -cors فكرتها محتاجه شرح وروقان كده بس الي بتعمله انها بتخليك تقدر تبعت ريكويست من اي سيرفر تاني 
      *سيرش علي cross origin request blocked*
    -express اعتقد دي اشهر حاجه مكتبه بتساعدك انك تعمل تقسم الروتس وتبني السيرفر
    -helmet مكتبه بتساعدك في انها بتعمل بعض الخطواط الي تحمي بيها السيرفر بتاعك
    -joi مكتبه بتساعدك انك تعمل فالديت للداتا
    -jsonwebtoken مكتبه بتعملك توكينز بتساعدك في الauthentication\
    -multer مكتبه عشان رفع الملفات للسيرفر
    -mysql2 مكتبه خاصه للتعامل مع الداتابيز
    -sequelize orm عشان تسهل التعامل مع الداتا بيز 
    -chance بتعمل حاجات عشوائيه هنستخدمها في اننا نعمل باسورد 
  ############################################################################
  ممكن تبدا تقرا الكود من تحت وهكتب فوق كل حاجه استخدمتها ليه  
*/

import { config } from 'dotenv';
// هنا احنا بنستدعي المكتبه عشان نقرا الداتا في ملف .env
config();
import run from './app';

// run the application
// هنا نقطه بدايه المشروع
// ./app.ts
run();
